Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварИЦена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦен/Ext/ManagerModule.bsl
&НаСервере
Процедура ПечатьНаСервереММ(ТабДок, Объект1) Экспорт
	ТипЦены = Объект1.ТипЦены;
	ДатаФормирования = Объект1.Дата;
	
	Макет = Документы.УстановкаЦен.ПолучитьМакет("Макет");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.Дата = Формат(ДатаФормирования, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.ТипЦены = ТипЦены;
	Табдок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовки");
	Табдок.Вывести(ОбластьЗаголовки);
	
	Для Каждого Строка из Объект1.ТоварИЦена Цикл
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Строка);
		ОбластьСтрокаТаблицы.Параметры.НомерПП = Строка.НомерСтроки;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
 КонецПроцедуры
